In [3]:
import pandas as pd
from sklearn.tree import DecisionTreeClassifier

In [4]:
#lendo os arquivo de treino e teste
train = pd.read_csv("train.csv")
test = pd.read_csv("test.csv")

In [5]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [9]:
#Excluindo e limpando as colunas nome, ingresso e cabine que não são uteis
train.drop(["Name","Ticket","Cabin"],axis=1,inplace=True)
test.drop(["Name","Ticket","Cabin"],axis=1,inplace=True)

In [11]:
#No Machine Learnig tuido tem que ser número, para isso usamos o get_dummies
new_data_train = pd.get_dummies(train)
new_data_test = pd.get_dummies(test)

In [13]:
new_data_train.head(6)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,1,0,3,22.0,1,0,7.2500,0.0,1.0,0.0,0.0,1.0
1,2,1,1,38.0,1,0,71.2833,1.0,0.0,1.0,0.0,0.0
2,3,1,3,26.0,0,0,7.9250,1.0,0.0,0.0,0.0,1.0
3,4,1,1,35.0,1,0,53.1000,1.0,0.0,0.0,0.0,1.0
4,5,0,3,35.0,0,0,8.0500,0.0,1.0,0.0,0.0,1.0
5,6,0,3,NaN,0,0,8.4583,0.0,1.0,0.0,1.0,0.0

In [14]:
new_data_test.head()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,892,3,34.5,0,0,7.8292,0.0,1.0,0.0,1.0,0.0
1,893,3,47.0,1,0,7.0000,1.0,0.0,0.0,0.0,1.0
2,894,2,62.0,0,0,9.6875,0.0,1.0,0.0,1.0,0.0
3,895,3,27.0,0,0,8.6625,0.0,1.0,0.0,0.0,1.0
4,896,3,22.0,1,1,12.2875,1.0,0.0,0.0,0.0,1.0

In [17]:
#Quantos valores nullos no conjunto de treino
new_data_train.isnull().sum().sort_values(ascending=False).head(10)

Embarked_S    0
Embarked_Q    0
Embarked_C    0
Sex_male      0
Sex_female    0
Fare          0
Parch         0
SibSp         0
Age           0
Pclass        0
dtype: int64

Nesse caso o dataset possui 177 valores inválidos para a coluna Age

In [18]:
#Preenchendo valores nulos
new_data_train['Age'].fillna(new_data_train['Age'].mean(),inplace = True)
new_data_test['Age'].fillna(new_data_test['Age'].mean(),inplace = True)

In [19]:
#Quantos valores nullos no conjunto de teste
new_data_test.isnull().sum().sort_values(ascending=False).head(10)

Fare          1
Embarked_S    0
Embarked_Q    0
Embarked_C    0
Sex_male      0
Sex_female    0
Parch         0
SibSp         0
Age           0
Pclass        0
dtype: int64

In [27]:
#Preenchendo valores nulos
new_data_test['Fare'].fillna(new_data_test['Fare'].mean(),inplace = True)

**Features** = são os dados de aprendizagem

**Target** = é o que queremos prever

In [28]:
#Separando features e target para criação de modelo
x = new_data_train.drop("Survived",axis=1) #df sem survived >> Feature
y = new_data_train["Survived"] #df só com survived >> Target

In [42]:
#Crianção do modelo de Machine Learn
tree = DecisionTreeClassifier(max_depth=3,random_state=0)
tree.fit(x,y)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=3,
            max_features=None, max_leaf_nodes=None, min_samples_leaf=1,
            min_samples_split=2, min_weight_fraction_leaf=0.0,
            presort=False, random_state=0, splitter='best')

In [43]:
tree.score(x,y)

0.8271604938271605

In [45]:
submission = pd.DataFrame()
submission["PassengerId"] = new_data_test["PassengerId"]
submission["Survived"] = tree.predict(new_data_test)

In [46]:
submission.to_csv("submission.csv", index=False)